{
  "recipes": [
    {
      "id": "1",
      "name": "Burger",
      "mealType": "lunch",
      "img": "burger.jpg",
      "difficulty": "easy",
      "description": "A classic juicy beef burger with fresh lettuce, tomato, and cheese.",
      "author": "by Food18",
      "total_time": "20 mins",
      "total_ingredients": 7,
      "calories": 450,
      "level": "easy",
      "brief_title": "Juicy Beef Burger",
      "detailed_description": "A juicy beef patty grilled to perfection, served in a soft, toasted bun with a generous layer of melted cheddar cheese. The freshness of crisp lettuce, juicy tomatoes, and creamy mayonnaise brings a satisfying crunch and flavor to each bite. This burger is a classic choice for a quick, delicious lunch or dinner.",
      "ingredients": [
        "1 lb ground beef",
        "4 burger buns",
        "4 slices cheddar cheese",
        "1 tomato, sliced",
        "Lettuce leaves",
        "4 tbsp mayonnaise",
        "Salt and pepper to taste"
      ],
      "preparation": [
        "Season the ground beef with salt and pepper and form into 4 patties.",
        "Preheat grill or pan over medium-high heat and cook patties for 4-5 minutes each side or until desired doneness.",
        "Toast the burger buns lightly on the grill.",
        "Spread mayonnaise on the bottom half of each bun.",
        "Place the cooked patties on the buns, then top each with a slice of cheese, tomato, and lettuce.",
        "Cover with the top half of the buns and serve immediately."
      ]
    },
    {
      "id": "2",
      "name": "Paneer Butter Masala",
      "mealType": "dinner",
      "img": "Pannerbutter.jpg",
      "difficulty": "hard",
      "description": "Rich and creamy Indian curry made with paneer cubes in buttery tomato sauce.",
      "author": "by Food18",
      "total_ingredients": 10,
      "calories": 350,
      "total_time": "45 mins",
      "level": "hard",
      "brief_title": "Creamy Paneer Butter Masala",
      "detailed_description": "Paneer Butter Masala is a rich, indulgent Indian curry featuring soft paneer cubes cooked in a luscious, creamy tomato-based sauce. The flavor comes from a mix of aromatic spices like garam masala, red chili powder, and coriander, creating a perfect balance of warmth and richness. It is best served with naan or rice for a satisfying dinner.",
      "ingredients": [
        "250g paneer cubes",
        "2 tbsp butter",
        "1 cup tomato puree",
        "1/2 cup cream",
        "1 tbsp ginger-garlic paste",
        "1 tsp garam masala",
        "1 tsp red chili powder",
        "1 tsp coriander powder",
        "Salt to taste",
        "Fresh coriander leaves for garnish"
      ],
      "preparation": [
        "Heat butter in a pan and sauté ginger-garlic paste until fragrant.",
        "Add tomato puree and cook until oil separates.",
        "Add spices and salt, cook for 2 minutes.",
        "Add paneer cubes and mix well.",
        "Pour in cream, simmer for 5 minutes.",
        "Garnish with coriander leaves and serve hot."
      ]
    },
    {
      "id": "3",
      "name": "Salad",
      "mealType": "lunch",
      "total_time": "10 mins",
      "img": "salad.jpg",
      "difficulty": "easy",
      "description": "A fresh mixed greens salad with seasonal vegetables and a light dressing.",
      "author": "by Food18",
      "total_ingredients": 6,
      "calories": 120,
      "level": "easy",
      "brief_title": "Fresh Veggie Salad",
      "detailed_description": "A simple and refreshing salad made with a variety of crisp mixed greens, complemented by fresh tomatoes, cucumber, and shredded carrots. The light olive oil and lemon dressing adds a tangy touch, making this salad a perfect side or light meal. It’s quick to make and a healthy way to incorporate more vegetables into your diet.",
      "ingredients": [
        "2 cups mixed greens",
        "1 cucumber, sliced",
        "1 tomato, chopped",
        "1/4 cup shredded carrots",
        "2 tbsp olive oil",
        "1 tbsp lemon juice"
      ],
      "preparation": [
        "Combine mixed greens, cucumber, tomato, and carrots in a bowl.",
        "Whisk olive oil and lemon juice to make dressing.",
        "Pour dressing over salad and toss gently.",
        "Serve fresh."
      ]
    },
    {
      "id": "4",
      "name": "Chicken Fry",
      "mealType": "dinner",
      "img": "chickenfry.jpg",
      "difficulty": "medium",
      "description": "Spicy and crispy fried chicken pieces marinated with special spices.",
      "author": "by Food18",
      "total_ingredients": 8,
      "total_time": "2 hrs 15 mins",
      "calories": 400,
      "level": "medium",
      "brief_title": "Spicy Crispy Chicken Fry",
      "detailed_description": "This spicy and crispy chicken fry is a perfect treat for those who enjoy bold flavors. The chicken is marinated in a mix of yogurt and a blend of spices, then fried until golden and crunchy. With every bite, you get the juicy tenderness of the chicken combined with the crispy exterior and a spicy kick. It's perfect for a weekend dinner or as a snack for gatherings.",
      "ingredients": [
        "500g chicken pieces",
        "1 cup yogurt",
        "2 tsp red chili powder",
        "1 tsp turmeric powder",
        "1 tbsp ginger-garlic paste",
        "Salt to taste",
        "Oil for frying",
        "1 cup all-purpose flour"
      ],
      "preparation": [
        "Marinate chicken with yogurt, spices, and salt for at least 2 hours.",
        "Coat marinated chicken with flour.",
        "Heat oil in a pan and fry chicken until golden and cooked through.",
        "Drain on paper towels and serve hot."
      ]
    },
    {
      "id": "5",
      "name": "Soup",
      "mealType": "snacks",
      "img": "soup.jpg",
      "difficulty": "easy",
      "description": "A warm and comforting vegetable soup perfect for cold days.",
      "author": "by Food18",
      "total_ingredients": 7,
      "total_time": "40 mins",
      "calories": 150,
      "level": "easy",
      "brief_title": "Comforting Vegetable Soup",
      "detailed_description": "This vegetable soup is a warm and comforting dish that’s perfect for chilly days. Packed with healthy vegetables like carrots, beans, and peas, it’s both nourishing and satisfying. The broth is light yet flavorful, and it’s an excellent low-calorie option for a quick snack or light meal.",
      "ingredients": [
        "2 cups mixed vegetables (carrots, beans, peas)",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "4 cups vegetable broth",
        "1 tsp salt",
        "1/2 tsp black pepper",
        "2 tbsp olive oil"
      ],
      "preparation": [
        "Heat olive oil in a pot and sauté onion and garlic.",
        "Add mixed vegetables and cook for 5 minutes.",
        "Pour in vegetable broth and bring to boil.",
        "Simmer for 20 minutes until vegetables are tender.",
        "Season with salt and pepper and serve warm."
      ]
    },
    {
      "id": "6",
      "name": "French Fries",
      "mealType": "snacks",
      "img": "frenchfries.jpg",
      "difficulty": "easy",
      "description": "Golden and crispy french fries, a perfect snack or side dish.",
      "author": "by Food18",
      "total_ingredients": 3,
      "total_time": "50 mins",
      "calories": 300,
      "level": "easy",
      "brief_title": "Crispy French Fries",
      "detailed_description": "Golden, crispy on the outside, and soft on the inside, these homemade French fries are the perfect snack or side dish. Made from fresh potatoes and deep-fried to perfection, they can be seasoned with a sprinkle of salt or your favorite spice mix. Serve them with ketchup or mayonnaise for an extra delicious treat.",
      "ingredients": [
        "4 large potatoes",
        "Oil for deep frying",
        "Salt to taste"
      ],
      "preparation": [
        "Peel and cut potatoes into thin sticks.",
        "Soak potatoes in cold water for 30 minutes, then drain and pat dry.",
        "Heat oil in a deep fryer and fry potatoes until golden and crispy.",
        "Drain excess oil, season with salt, and serve hot."
      ]
    },
    {
      "id": "7",
      "name": "Pancake",
      "mealType": "breakfast",
      "img": "pancake.jpg",
      "difficulty": "medium",
      "description": "Fluffy pancakes served with syrup and fresh fruits for a delightful breakfast.",
      "author": "by Food18",
      "total_time": "20 mins",
      "total_ingredients": 8,
      "calories": 350,
      "level": "medium",
      "brief_title": "Fruit-Filled Pancake Delight",
      "detailed_description": "These fluffy, golden pancakes are the perfect start to your day. Made with a simple batter, they rise beautifully on the griddle and are topped with fresh fruits like strawberries, bananas, or blueberries. Drizzle with maple syrup for the ultimate sweet treat that’s comforting and delicious.",
      "ingredients": [
        "1 cup all-purpose flour",
        "1 tbsp sugar",
        "1 tsp baking powder",
        "1/2 tsp baking soda",
        "1 cup milk",
        "1 egg",
        "2 tbsp melted butter",
        "Maple syrup and fresh fruits for serving"
      ],
      "preparation": [
        "Mix flour, sugar, baking powder, and baking soda in a bowl.",
        "Whisk milk, egg, and melted butter in another bowl.",
        "Combine wet and dry ingredients until smooth.",
        "Heat a non-stick pan and pour batter to form pancakes.",
        "Cook until bubbles form, then flip and cook the other side.",
        "Serve warm with syrup and fruits."
      ]
    },
    {
      "id": "8",
      "name": "Biriyani",
      "mealType": "dinner",
      "img": "biriyani.jpg",
      "difficulty": "hard",
      "description": "A fragrant and flavorful Indian rice dish cooked with spices, meat, and herbs.",
      "author": "by Food18",
      "total_ingredients": 12,
      "calories": 550,
      "level": "hard",
      "total_time": "1 hr 45 mins",
      "brief_title": "Fragrant Chicken Biriyani",
      "detailed_description": "Biriyani is a flavorful and aromatic rice dish layered with tender chicken, fragrant basmati rice, and an assortment of spices. The chicken is cooked in a rich, spiced yogurt marinade, then layered with partially cooked rice and slow-cooked to perfection. This dish is perfect for special occasions and is best served with raita or a side salad.",
      "ingredients": [
        "2 cups basmati rice",
        "500g chicken pieces",
        "1 cup yogurt",
        "2 large onions, thinly sliced",
        "2 tomatoes, chopped",
        "4 cloves garlic, minced",
        "1 inch ginger, minced",
        "2 green chilies, slit",
        "1/4 cup fresh coriander leaves",
        "1/4 cup fresh mint leaves",
        "2 tsp biriyani masala powder",
        "Salt to taste"
      ],
      "preparation": [
        "Wash and soak basmati rice for 30 minutes.",
        "Heat oil in a large pan and fry onions until golden brown. Set half aside for garnishing.",
        "Add garlic, ginger, and green chilies to the pan and sauté.",
        "Add chicken pieces and cook until browned.",
        "Mix in yogurt, tomatoes, biriyani masala powder, salt, coriander, and mint leaves. Cook until chicken is tender.",
        "In a separate pot, boil water and cook rice until 70% done. Drain and set aside.",
        "Layer the chicken mixture and rice in a heavy-bottomed pot, starting with chicken at the bottom.",
        "Top with fried onions and cover tightly.",
        "Cook on low heat for 25-30 minutes to allow flavors to meld.",
        "Serve hot with raita or salad."
      ]
    },
    {
      "id": "9",
      "name": "Masala Dosa",
      "mealType": "breakfast",
      "img": "dosa.jpg",
      "difficulty": "medium",
      "description": "Crispy fermented rice crepes stuffed with spiced potato filling.",
      "author": "by Food18",
      "total_ingredients": 10,
      "calories": 300,
      "level": "medium",
      "total_time": "10 mins",
      "brief_title": "Crispy Masala Dosa",
      "detailed_description": "Masala Dosa is a popular South Indian breakfast dish made with thin, crispy crepes (dosas) filled with a spicy potato mixture. The dosas are made from fermented rice and urad dal batter, and the potato filling is flavored with mustard seeds, turmeric, and green chilies. Served with chutney and sambar, it’s a flavorful and filling way to start your day.",
      "ingredients": [
        "1 cup rice",
        "1/2 cup urad dal (split black gram)",
        "2 large potatoes, boiled and mashed",
        "1 onion, finely chopped",
        "1 tsp mustard seeds",
        "1 tsp turmeric powder",
        "2 green chilies, chopped",
        "1 tbsp oil",
        "Salt to taste",
        "Fresh coriander leaves for garnish"
      ],
      "preparation": [
        "Soak rice and urad dal separately for 6-8 hours.",
        "Grind soaked ingredients into a smooth batter and ferment overnight.",
        "Heat oil in a pan, add mustard seeds. When they splutter, add onions, turmeric, green chilies, and potatoes.",
        "Cook for 5 minutes, season with salt and garnish with coriander.",
        "Heat a non-stick pan, pour batter and spread thinly to form a dosa.",
        "Place the potato filling inside, fold and cook for 2 more minutes.",
        "Serve hot with chutney and sambar."
      ]
    },
    {
      "id": "10",
      "name": "Choco Cookies",
      "mealType": "snacks",
      "img": "chip.jpg",
      "difficulty": "easy",
      "description": "Soft and chewy cookies loaded with chocolate chips, perfect for a sweet treat.",
      "author": "by Food18",
      "total_ingredients": 8,
      "calories": 250,
      "total_time": "25-30 mins",
      "level": "easy",
      "brief_title": "Chewy Choco Chip Cookies",
      "detailed_description": "These soft and chewy cookies are packed with gooey chocolate chips, making them the perfect sweet snack or dessert. The dough is simple to make, and after baking for just 10-12 minutes, you’re left with warm, delicious cookies. Enjoy them with a glass of milk for an irresistible treat.",
      "ingredients": [
        "1 cup all-purpose flour",
        "1/2 tsp baking soda",
        "1/4 tsp salt",
        "1/2 cup unsalted butter, softened",
        "1/2 cup brown sugar",
        "1/4 cup white sugar",
        "1 egg",
        "1 cup chocolate chips"
      ],
      "preparation": [
        "Preheat oven to 350°F (175°C).",
        "Mix flour, baking soda, and salt in a bowl.",
        "In another bowl, cream butter and sugars until smooth.",
        "Add egg and mix well.",
        "Gradually add dry ingredients to wet ingredients, then fold in chocolate chips.",
        "Drop spoonfuls onto baking sheet and bake for 10-12 minutes.",
        "Cool on wire rack and enjoy."
      ]
    },
    {
      "id": "11",
      "name": "Vegetable Stir Fry",
      "mealType": "lunch",
      "img": "stir.jpg",
      "difficulty": "easy",
      "description": "Quick and healthy stir-fried mixed vegetables with soy sauce and garlic.",
      "author": "by Food18",
      "total_ingredients": 7,
      "calories": 180,
      "total_time": "17 mins",
      "level": "easy",
      "brief_title": "Healthy Vegetable Stir Fry",
      "detailed_description": "A quick and easy vegetable stir-fry that’s packed with fresh, crunchy vegetables like broccoli, bell peppers, and snap peas. Tossed in a light soy sauce and garlic-based dressing, it’s a colorful and healthy dish that pairs well with rice or noodles. It’s a great option for a quick, nutritious lunch or side dish.",
      "ingredients": [
        "1 cup broccoli florets",
        "1 carrot, sliced",
        "1 bell pepper, sliced",
        "1/2 cup snap peas",
        "2 cloves garlic, minced",
        "2 tbsp soy sauce",
        "1 tbsp vegetable oil"
      ],
      "preparation": [
        "Heat oil in a wok or pan over high heat.",
        "Add garlic and sauté until fragrant.",
        "Add all vegetables and stir fry for 5-7 minutes until tender-crisp.",
        "Pour in soy sauce and toss to coat evenly.",
        "Serve hot with rice or noodles."
      ]
    }
  ],
  "register_user": [
    {
      "id": "5e2f",
      "name": "ji",
      "email": "ji@gmail.com",
      "password": "ji",
      "Confirm_password": "ji"
    },
    {
      "id": "a013",
      "name": "pri",
      "email": "j@gmail.com",
      "password": "po",
      "Confirm_password": "po"
    },
    {
      "id": "05ee",
      "name": "priya",
      "email": "laxmi@gmail.com",
      "password": "pri123",
      "Confirm_password": "pri123"
    },
    {
      "id": "70d2",
      "name": "Iniyaazh",
      "email": "ini@gmail.com",
      "password": "ini",
      "Confirm_password": "ini"
    },
    {
      "id": "cb51",
      "name": "nanda",
      "email": "nanda@gmail.com",
      "password": "12",
      "Confirm_password": "12"
    }
  ]
}